---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData
source: html/b60eda86-ca0a-d024-a535-f251682ea281.htm
---
# DuctFittingAndAccessoryPressureDropData Members

Releases all resources used by the DuctFittingAndAccessoryPressureDropData